from icecream import ic
import math as m
import numpy as np
import matplotlib.pyplot as plt
from scipy.interpolate import interp1d
import scipy


x = np.array([130, 100, 98, 96, 94, 92, 90, 88, 86, 84, 82, 80, 78, 76, 74, 72, 70, 68, 66, 64, 62, 60, 58, 56, 54, 52, 50, 48, 46, 44, 42, 40, 38, 36, 34, 32, 31, 30, 29, 28, 27, 26, 25, 24, 23, 22, 21, 20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0])
y = np.array([3.972*10**(-8), 7.890*10**(-5), 1.347*10**(-4), 0.0002, 0.0004, 0.0007, 0.0012, 0.0019, 0.0031, 0.0049, 0.0077, 0.0119, 0.0178, 0.0266, 0.0393, 0.0578, 0.0839, 0.1210, 0.1729, 0.2443, 0.3411, 0.4694, 0.6289, 0.8183, 1.0320, 1.2840, 1.5940, 1.9670, 2.4260, 2.9850, 3.6460, 4.4040, 5.2760, 6.2740, 7.4200, 8.7040, 9.4060, 10.1500, 10.9300, 11.7700, 12.6500, 13.5900, 14.5700, 15.6200, 16.7100, 17.8800, 19.1100, 20.3900, 21.7400, 23.1800, 24.6800, 26.2700, 27.9500, 29.7400, 31.6000, 33.5400, 35.5800, 37.7200, 39.9500, 42.2600, 44.7100, 47.2400, 49.8700, 52.6200, 55.4700, 58.4500, 61.5600, 64.7900])
# Предварительные шаги: прологарифмируем значения y
ln_y = np.log(y)
# Линейная регрессия методом наименьших квадратов
X = np.vstack([x, np.ones(len(x))]).T
b, A = np.linalg.lstsq(X, ln_y, rcond=None)[0]

# Преобразование коэффициентов обратно к экспоненциальной функции
a = np.exp(A)
b = b

# Функция, аппроксимирующая экспоненциальную зависимость
def exponential_approx(x):
    return a * np.exp(b * x)

# Пример использования
x_new = np.array([130, 128, 126, 124, 122, 120, 118, 116, 114, 112, 110, 108, 106, 104, 102, 100, 98, 96, 94, 92, 90, 88, 86,
         84, 82, 80, 78, 76, 74, 72, 70, 68, 66, 64, 62, 60, 58, 56, 54, 52, 50, 48, 46, 44, 42, 40, 38, 36, 34, 32,
         31, 30, 29, 28, 27, 26, 25, 24, 23, 22, 21, 20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3,
         2, 1, 0])  # Новые значения x, для которых нужно вычислить аппроксимацию
y_approx = exponential_approx(x_new)
print(x_new)
print(y_approx)
plt.plot(y_approx, x_new)
plt.show()